# Connection Oracle in Python

## Oracle Connection Example 1

In [1]:
import cx_Oracle
import pandas as pd

In [2]:
# Oracle Connection

cx_Oracle.init_oracle_client(lib_dir=r"C:\oracle\instantclient_21_3")
connection = cx_Oracle.connect(user="ora01", password="Dltnscjs100@", dsn="edudb_high")
cursor = connection.cursor()

In [5]:
# Create a table

cursor.execute("""begin
                     execute immediate 'drop table pytab';
                     exception when others then if sqlcode <> -942 then raise; end if;
                  end;""")
cursor.execute("create table pytab (id number, data varchar2(20))")

In [6]:
# Insert some rows

rows = [ (1, "First" ),
         (2, "Second" ),
         (3, "Third" ),
         (4, "Fourth" ),
         (5, "Fifth" ),
         (6, "Sixth" ),
         (7, "Seventh" ) ]

cursor.executemany("insert into pytab(id, data) values (:1, :2)", rows)

In [8]:
# Commit
connection.commit()

In [14]:
# Now query the rows back

for row in cursor.execute('select * from pytab'):
    print(row)

(1, 'First')
(2, 'Second')
(3, 'Third')
(4, 'Fourth')
(5, 'Fifth')
(6, 'Sixth')
(7, 'Seventh')

## Oracle Connection Examples 2

In [1]:
import cx_Oracle

# Oracle Connection
cx_Oracle.init_oracle_client(lib_dir=r"C:\oracle\instantclient_21_3")
connection = cx_Oracle.connect(user="ora01", password="Dltnscjs100@", dsn="edudb_high")
cursor = connection.cursor()

In [15]:
cursor.execute('''select empno, ename, job, deptno, sal 
                    from emp e
                   where sal > (select avg(sal)
                                  from emp
                                 where deptno = e.deptno)''')

In [4]:
qdata = [empno for empno in cursor]
empno = [x[0] for x in qdata]
ename = [x[1] for x in qdata]
job = [x[2] for x in qdata]

In [5]:
empno

[7499, 7566, 7698, 7788, 7839, 7902]

In [6]:
ename

['ALLEN', 'JONES', 'BLAKE', 'SCOTT', 'KING', 'FORD']

In [7]:
job

['SALESMAN', 'MANAGER', 'MANAGER', 'ANALYST', 'PRESIDENT', 'ANALYST']

## Oracle Connection in Pandas

In [10]:
import pandas as pd
import cx_Oracle

In [13]:
# Oracle Connection

cx_Oracle.init_oracle_client(lib_dir=r"C:\oracle\instantclient_21_3")
connection = cx_Oracle.connect(user="ora01", password="Dltnscjs100@", dsn="edudb_high")
cursor = connection.cursor()

ProgrammingError: Oracle Client library has already been initialized

In [16]:
query = '''select * from emp'''
df_emp = pd.read_sql(query, connection)

df_emp.columns

Index(['EMPNO', 'ENAME', 'JOB', 'MGR', 'HIREDATE', 'SAL', 'COMM', 'DEPTNO'], dtype='object')

In [17]:
df_emp.head()

   EMPNO   ENAME       JOB     MGR   HIREDATE     SAL    COMM  DEPTNO
0   7369   SMITH     CLERK  7902.0 1980-12-17   800.0     NaN      20
1   7499   ALLEN  SALESMAN  7698.0 1981-02-20  1600.0   300.0      30
2   7521    WARD  SALESMAN  7698.0 1981-02-22  1250.0   500.0      30
3   7566   JONES   MANAGER  7839.0 1981-04-02  2975.0     NaN      20
4   7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250.0  1400.0      30

In [18]:
df_emp['EMPNO'].head()

0    7369
1    7499
2    7521
3    7566
4    7654
Name: EMPNO, dtype: int64

In [19]:
df_emp[['EMPNO','ENAME']]

    EMPNO   ENAME
0    7369   SMITH
1    7499   ALLEN
2    7521    WARD
3    7566   JONES
4    7654  MARTIN
5    7698   BLAKE
6    7782   CLARK
7    7788   SCOTT
8    7839    KING
9    7844  TURNER
10   7876   ADAMS
11   7900   JAMES
12   7902    FORD
13   7934  MILLER

In [21]:
df_emp[df_emp.SAL >= 1800]

    EMPNO  ENAME        JOB     MGR   HIREDATE     SAL  COMM  DEPTNO
3    7566  JONES    MANAGER  7839.0 1981-04-02  2975.0   NaN      20
5    7698  BLAKE    MANAGER  7839.0 1981-05-01  2850.0   NaN      30
6    7782  CLARK    MANAGER  7839.0 1981-06-09  2450.0   NaN      10
7    7788  SCOTT    ANALYST  7566.0 1982-12-09  3000.0   NaN      20
8    7839   KING  PRESIDENT     NaN 1981-11-17  5000.0   NaN      10
12   7902   FORD    ANALYST  7566.0 1981-12-03  3000.0   NaN      20

In [23]:
# Error Occured
# df_emp[df_emp.SAL >= 1800 & df_emp.SAL <= 2900]

# 1500 이상 2900 이하 급여를 받는 사원들에 대한 정보 확인
df_emp[(df_emp.SAL >= 1800) & (df_emp.SAL <= 2900)]

   EMPNO  ENAME      JOB     MGR   HIREDATE     SAL  COMM  DEPTNO
5   7698  BLAKE  MANAGER  7839.0 1981-05-01  2850.0   NaN      30
6   7782  CLARK  MANAGER  7839.0 1981-06-09  2450.0   NaN      10

## Pandas DataFrame을 List로 생성하여 데이터 입력

In [ ]:
import pandas as pd
import cx_Oracle
from sqlalchemy import types, create_engine

# Oracle Connection
cx_Oracle.init_oracle_client(lib_dir=r"C:\oracle\instantclient_21_3")
connection = cx_Oracle.connect(user="ora01", password="Dltnscjs100@", dsn="edudb_high")
cursor = connection.cursor()

In [24]:
# DataFrame 생성
data = {'name':['Lee', 'Hwang', 'Kim', 'Choi'],
        'score':[100, 95, 80, 85], 
        'grade':['A','A','B','B']}
df = pd.DataFrame(data)
df

    name  score grade
0    Lee    100     A
1  Hwang     95     A
2    Kim     80     B
3   Choi     85     B

In [26]:
# 데이터 타입 확인
type(df)
cursor.execute('''create table test_tname(name   varchar2(10)
                                        , score  number(5,2)
                                        , grade  varchar2(3))''')
test_list = df.values.tolist()
print(test_list)

[['Lee', 100, 'A'], ['Hwang', 95, 'A'], ['Kim', 80, 'B'], ['Choi', 85, 'B']]

In [27]:
# Data Insert to Oracle
cursor.executemany("insert into test_tname(name, score, grade) values (:1, :2, :3)", test_list)

In [28]:
# Commit
connection.commit()

In [29]:
cursor.close()
connection.close()